# ...
class Player:
    def __init__(self, name, hp, damage):
        self.name = name
        self.hp = hp
        self.damage = damage
        self.xp = 0
        self.lvl = 1

    # ...

# Словари характеристик рас и профессий
races = {
    "эльф": (1.5, 1),
    "гном": (0.8, 1.2),
    "человек": (1, 1),
    "дампир": (1.5, 1.5),
    "зверолюди": (2, 0.8)
}

profs = {
    "лучник": (0.9, 2),
    "щитоносец": (2, 0.6),
    "рыцарь": (1.2, 1.2),
    "колдун": (1.5, 1.5),
    "искатель": (1, 1)
}

races_enemy = {
        "Слизняк": (10, 10),
        "Волк": (25, 20),
        "Орк": (50, 45),
        "Группа гоблинов": (120, 25),
        "Оборотень": (150, 50),
        "Великан": (200, 100),
        "Дракон": (300, 200),
        "Скелет": (50, 10),

}
