"""
Упражнение 138. Текстовые сообщения.
Напишите программу, отображающую последовательность кнопок, которую необходимо нажать,
чтобы на экране телефона появился текст, введенный пользователем. Создайте словарь, сопоставляющий символы с кнопками,
которые необходимо нажать, а затем воспользуйтесь им для вывода на экран последовательности кнопок в соответствии с
введенным пользователем сообщением по запросу. Например, на ввод строки Hello, World! ваша программа должна откликнуться
следующим выводом: 443355 5555666110966677755531111. Удостоверьтесь, что ваша программа корректно обрабатывает
строчные и прописные буквы. При преобразовании букв в цифры игнорируйте символы, не входящие в указанный перечень,
такие как точка с запятой или скобки.
"""

