"""
Упражнение 137. Две игральные кости.
В данном упражнении мы будем симулировать 1000 выбрасываний игральных костей. Начнем с написания функции,
выполняющей случайное выбрасывание двух обычных шестигранных костей. Эта функция не будет принимать входных параметров,
а возвращать должна число, выпавшее в сумме на двух костях.
В основной программе реализуйте симуляцию тысячи выбрасываний костей. Программа должна хранить все результаты с
частотой их выпадения. После завершения процесса должна быть показана итоговая таблица с результатами, похожая на ту,
что представлена в табл. 6.1. Выразите частоту выпадения каждого из чисел в процентах вместе с ожидаемым результатом
согласно теории вероятностей.
"""