"""
Упражнение 148. Играем в лото.
В данном упражнении мы напишем программу, выполняющую симуляцию игры в лото с одной картой.
Начните с генерирования списка из всех возможных номеров для выпадения (от B1 до O75). После этого перемешайте номера в
хаотичном порядке, воспользовавшись функцией shuffle из модуля random. Вытаскивайте по одному номеру из списка и
зачеркивайте номера, пока карточка не окажется выигравшей. Проведите 1000 симуляций и выведите на экран минимальное,
максимальное и среднее количество извлечений номеров, требующееся для выигрыша.
При решении этой задачи вы можете воспользоваться функциями из упражнений 146 и 147.
"""