"""
Упражнение 146. Карточка лото.
Напишите функцию, которая будет создавать случайную карточку лото и сохранять ее в словаре.
Ключами словаря будут буквы B, I, N, G и O, а значениями – списки из пяти чисел, располагающихся в колонке под
каждой буквой. Создайте еще одну функцию для отображения созданной карточки лото на экране со столбцами с заголовками.
В основной программе создайте карту лото случайным образом и выведите ее на экран.
Ваша программа должна запускаться только в том случае, если она не импортирована в виде модуля в другой файл.
"""
