"""
Упражнение 168. Повторяющиеся слова.
В данном упражнении вам предстоит написать программу для определения наличия дублей слов в тексте.
При нахождении повтора на экран должен выводиться номер строки и дублирующееся слово. Удостоверьтесь,
что программа корректно обрабатывает случаи, когда повторяющиеся слова находятся на разных строках,
как в предыдущем примере. Имя файла для анализа должно быть передано программе в качестве единственного аргумента
командной строки. При отсутствии аргумента или невозможности открыть указанный файл на экране
должно появляться соответствующее сообщение об ошибке.
"""
import sys
