"""
Упражнение 169. Редактирование текста в файле.
В данном упражнении вам необходимо написать программу, которая будет заменять все служебные слова в
тексте на символы звездочек (по количеству символов в словах).
Вы должны осуществлять регистрозависимый поиск служебных слов в тексте,
даже если эти слова входят в состав других слов.
Список служебных слов должен храниться в отдельном файле.
Сохраните отредактированную версию исходного файла в новом файле.
Имена исходного файла, файла со служебными словами и нового файла должны быть введены пользователем.
"""