"""
Упражнение 171. Строки фиксированной длины.
Напишите программу, которая будет открывать файл и выводить его на экран с постоянной длиной строк.
Если в исходном файле строка оказывается слишком длинной, «лишние» слова должны быть перенесены на следующую строку,
а если слишком короткой, слова со следующей строки должны перекочевать в конец текущей до полного ее заполнения.
Убедитесь, что ваша программа корректно обрабатывает тексты, в которых присутствуют абзацы.
Идентифицировать конец одного абзаца и начало другого можно по наличию пустой строки в
тексте после удаления символа конца строки.
"""
