"""
Упражнение 172. Слова с шестью гласными в ряд.
Существует как минимум одно слово в английском языке, содержащее все гласные буквы в том порядке,
в котором они расположены в алфавите, а именно A, E, I, O, U и Y.
Напишите программу, которая будет просматривать текстовый файл на предмет поиска и отображения таких слов.
Имя исходного файла должно быть запрошено у пользователя.
Если имя файла окажется неверным или возникнут иные ошибки при чтении файла,
выведите соответствующее сообщение об ошибке.
"""