"""
Упражнение 170. Пропущенные комментарии.
Напишите программу, которая будет проходить по файлу с исходным кодом на Python и искать функции,
не снабженные блоком комментариев. Можно принять за аксиому, что строка, начинающаяся со слова def,
следом за которым идет пробел, будет считаться началом функции. И если функция документирована,
предшествующая строчка должна начинаться со знака #. Перечислите названия всех функций,
не снабженных комментариями, вместе с именем файла и номером строки, с которой начинается объявление функции
"""
