"""
Упражнение 182. Слова через химические элементы.
Напишите рекурсивную функцию, способную определять, можно ли выразить переданное ей слово исключительно через
обозначения химических элементов. Ваша функция должна принимать два параметра: слово, которое нужно проверить, и
список символов, которые можно при этом использовать. Возвращать функция должна строку, состоящую из использованных
символов, если собрать искомое слово можно, и пустую строку в противном случае. При этом регистры символов учитываться
не должны.
В основной программе должна быть использована ваша функция для проверки всех элементов таблицы
Менделеева на возможность составить их названия из обозначений химических элементов. Отобразите на экране названия элементов вместе с обозначениями, которые были использованы для их написания.
"""

