# Создаём словарь абонентов
my_ket = {
    "Сидоров": [8953920000, 8953920002],
    "Петров": [8953920001],
    "Смирнова": [8953920200],
    "Игорев":[8953920003, 8953920005],
    "Волков": [8953920004],
    "Гостинена": [8953960000],
    "Васильев": [8953920700],
    "Соколова": [8953920900]
}

# Изменили номер
my_ket["Гостинена"] = '+7-(999)-883-22-01'
print(my_ket["Гостинена"])

# Удалили номер
my_ket.pop("Смирнова")
print(my_ket)


Name = input("  ведите фамилию обонента  ")
print(f"найден номер телефона {my_ket[Name]}")
