"""
Упражнение 1. Почтовый адрес.
Напишите несколько строк кода, выводящих на экран ваше имя и почтовый адрес.
Адрес напишите в формате, принятом в вашей стране.
Никакого ввода от пользователя ваша первая программа принимать не будет, только вывод на экран и больше ничего.
"""
print('Моё имя - ')
print('Моя фамилия - ')
print('Мой почтовый адрес - ')