"""
Упражнение 2. Приветствие
Напишите программу, запрашивающую у пользователя его имя.
В ответ на ввод на экране должно появиться приветствие с обращением по имени, введенному с клавиатуры ранее.
"""
name = input('Как тебя зовут? ')
print(f'Добро пожаловать {name}!')