"""
Упражнение 105. Произвольные системы счисления.
Напишите программу, которая позволит пользователю преобразовывать числа из одной системы счисления в другую
произвольным образом. Ваша программа должна поддерживать все системы счисления в диапазоне от 2 до 16 как для входных,
так и для выходных данных. Если пользователь выберет систему с основанием, выходящим за границы допустимого,
на экран должна быть выведена ошибка. Разделите код программы на несколько функций, включая функцию,
конвертирующую число из произвольной системы счисления в десятичную, и обратную функцию, переводящую значение из
десятичной системы в произвольную.
"""
