"""
Упражнение 107. Максимальное сокращение дробей.
Напишите функцию, принимающую на вход два целочисленных параметра, представляющих числитель и знаменатель дроби.
В теле функции должно выполняться максимально возможное сокращение дроби, а полученные в итоге числитель и знаменатель
должны быть возвращены исходной программе. Например, если на вход функции передать числа 6 и 63,
числитель и знаменатель итоговой дроби должны быть 2 и 21. В основной программе нужно запросить у пользователя
числитель и знаменатель исходной дроби, передать их в функцию и вывести на экран результат.
"""
