"""
Упражнение 112. Удаляем выбросы.
Напишите функцию, создающую копию списка с исключенными из него n наибольшими и наименьшими значениями и
возвращающую ее в качестве результата.
Порядок следования элементов в измененном списке не обязательно должен в точности совпадать с источником.
В основной программе должна быть продемонстрирована работа вашей функции.
Для начала попросите пользователя ввести целые числа, затем соберите их в список и вызовите написанную вами ранее
функцию. Выведите на экран измененную версию списка вместе с оригинальной.
Если пользователь введет менее четырех чисел, должно быть отображено соответствующее сообщение об ошибке.
"""
