"""
Упражнение 134. Все подсписки заданного списка
Используя определение подсписка из упражнения 133, напишите функцию, возвращающую список, содержащий все возможные
подсписки заданного. Например, в число подсписков списка [1, 2, 3] входят следующие: [], [1], [2], [3], [1, 2], [2, 3]
и [1, 2, 3]. Заметьте, что ваша функция должна вернуть как минимум один пустой список,
гарантированно являющийся подсписком для любого списка. Напишите основную программу,
демонстрирующую работу функции применительно к нескольким исходным спискам.
"""
