"""
Упражнение 130. Унарные и бинарные операторы.
Напишите функцию для поиска унарных операторов + и – в списке лексем и их замены на сочетание символов
u+ и u– соответственно. Функция должна принимать в качестве единственного параметра список лексем математического
выражения и возвращать его копию с произведенной заменой унарных операторов. Оператор + или – можно идентифицировать
как унарный в одном из двух случаев: если он идет первым в списке или если ему предшествует другой оператор либо
открывающая скобка. Во всех остальных случаях оператор может считаться бинарным.
В основной программе продемонстрируйте работу функции. Запросите у пользователя строку с математическим выражением,
разбейте ее на лексемы, выделите в отдельный список унарные операторы и выведите их на экран.
"""
