"""
Упражнение 131. Инфиксная запись – в постфиксную.
Используйте свои наработки из упражнений 129 и 130 для разделения математических выражений на лексемы и поиска в них
унарных операторов. После этого используйте алгоритм, приведенный выше, для преобразования выражения из инфиксной формы
в постфиксную. Код, реализующий этот алгоритм, должен быть заключен в функцию, принимающую на вход список лексем
инфиксного выражения (с помеченными унарными операторами). Возвращать функция будет список лексем в постфиксном
выражении. В основной программе продемонстрируйте работу функции по преобразованию инфиксной формы записи
математического выражения в постфиксную. Запросите у пользователя выражение инфиксного типа и выведите на экран
его постфиксный аналог.
"""
