"""
Упражнение 90. Двенадцать дней Рождества.
Напишите программу, которая будет сама строить куплеты этой песенки.
В программе должна присутствовать функция для отображения одного куплета.
В качестве входного параметра она должна принимать порядковый номер дня,
а в качестве результата возвращать готовый куплет.
Далее в основной программе эта функция должна быть вызвана 12 раз подряд.
Каждая строка с очередным подарком должна присутствовать в вашей программе лишь раз,
за исключением строки «A partridge in a pear tree».
В этом случае вы можете отдельно хранить такой вид строки для первого куплета и слегка измененный
(«And a partridge in a pear tree») – для всех последующих.
Импортируйте свою функцию из упражнения 89 для выполнения этого задания.
"""

