"""
Симуляция должна запускаться после ввода кол-во часов симуляции. По итогу должен вывести смерть /победа / или текущий
прогресс персонажа за прошедшее время. Результат должен вывести подробную информацию, о постройках персонажа, его улучшениях, его броне,
добытых ресурсах.

1) Генерация руды.
## Зависит от уровня развития местности (карты), карта не бесконечна. У руды есть заканчиваемый ресурс
- Уголь, Железо, медь, камень, (уран, нефть)

2) Добыча ресурсов
## Тратится время

3) Производство
# Материалы будут изготавливаться персонажем моментально

4) Уровень загрязнения
## Увеличивается от некоторых машин

5) Военная промышленность
## Увеличивает шанс выживаемости персонажа. Нужно для обороны объектов. Необходимы улучшения технологий *лаборатория

6) Энергия
## Необходимы для машин

7) Лаборатория
## Тратится время для открытия улучшения

8) Условия победы
## Уничтожение всех монстров на планете/ Постройка ракеты

9) Условия проигрыша
# Смерть персонажа

"""