"""
Определите класс Rectangle с атрибутами width и height, которые представляют собой ширину и высоту прямоугольника.
Переопределите методы __eq__ и __le__, чтобы определить, когда два прямоугольника равны и
когда один прямоугольник меньше или равен другому.

Например, если у вас есть два прямоугольника r1 = Rectangle(2, 3) и r2 = Rectangle(2, 3),
то r1 == r2 должно вернуть True, а r1 <= r2 должно вернуть True.
Если у вас есть два прямоугольника r1 = Rectangle(2, 3) и r2 = Rectangle(3, 4), то r1 <= r2 должно вернуть True.
"""