def my_func(surname, lesson):
    my_dict = {
        'Степаньюченко': {
            'математика': [2, 2, 3, 2, 3],
            'физика': [2, 3, 3, 3, 3],
            'химия': [5, 5, 5,  5, 5],
            'литература': [2, 2, 2, 1, 2]
        },
        'Бязров': {
            'математика': [4, 4, 4, 3, 5],
            'физика': [5, 5, 4, 5, 4],
            'химия': [4, 3, 5,  5, 4],
            'литература': [3, 4, 4, 5, 5]
        },
        'Ивашкин': {
            'математика': [3, 3, 4, 5, 5],
            'физика': [4, 3, 5, 4, 4],
            'химия': [5, 5, 5,  4, 4],
            'литература': [4, 4, 3, 4, 5]
        }
    }

    grades = my_dict[surname][lesson]

    ask = input("Введите 1 для вывода всех оценок или 2 для вывода среднего балла: ")

    if ask == '1':
        return f"Оценки по предмету ({lesson}) у  {surname}: {grades}"
    elif ask == '2':
        average = sum(grades) / len(grades)
        return f"Средний балл - ({lesson}) у  {surname}: {average:.2f}"
    else:
        return "Неправильный ввод"


result = my_func('Степаньюченко', 'химия')
print(result)
